Repository: Dsite42/ft_transcendence
Catalog: web/locale/*/LC_MESSAGES/django.po
Languages: de, fr

source: Method not allowed
de: Methode nicht erlaubt
fr: Méthode non autorisée

source: Invalid content type
de: Ungültiger Inhaltstyp
fr: Type de contenu invalide

source: Malformed JSON
de: Fehlerhaftes JSON
fr: JSON malformé

source: Internal server error
de: Interner Serverfehler
fr: Erreur interne du serveur

source: Username is not provided
de: Benutzername nicht angegeben
fr: Nom d'utilisateur non fourni

source: No TOTP Device associated with this user
de: Kein TOTP Device mit diesem Nutzer verbunden
fr: Aucun TOTP Device associé à cet utilisateur

source: OTP is valid
de: OTP ist gültig
fr: L'OTP est valide.

source: OTP is invalid
de: OTP ist ungültig
fr: L'OTP est invalide.

source: All OTP devices have been removed.
de: Alle OTP-Geräte wurden entfernt.
fr: Tous les appareils OTP ont été supprimés.

source: User {} does not exist.
de: Benutzer {} existiert nicht.
fr: L'utilisateur {} n'existe pas.

source: Display name is already in use.
de: Anzeigename ist bereits vergeben.
fr: Le nom d'affichage est déjà utilisé.

source: Display name is someones intra name.
de: Anzeigename ist jemandes Intraname.
fr: Le nom d'affichage est le nom intra de quelqu'un.

source: File is not an image.
de: Datei ist kein Bild.
fr: Le fichier n'est pas une image.

source: User does not exist
de: Benutzer existiert nicht
fr: L'utilisateur n'existe pas.

source: Could not add friend
de: Konnte Freund nicht hinzufügen
fr: Impossible d'ajouter un ami.

source: Invalid request method
de: Ungültige Anfragemethode
fr: Méthode de requête invalide.

source: Could not accept friend request
de: Konnte Freundschaftsanfrage nicht annehmen
fr: Impossible d'accepter la demande d'ami.

source: Could not decline friend request
de: Konnte Freundschaftsanfrage nicht ablehnen
fr: Impossible de refuser la demande d'ami.

source: Friends
de: Freunde
fr: Amis

source: Enter friends intra-name
de: Intraname des Freundes
fr: Entrez le nom intra de l'ami

source: Add Friend
de: Freund hinzufügen
fr: Ajouter un ami

source: Online
fr: En ligne

source: Last online:
de: Zuletzt online:
fr: Dernière connexion :

source: No friends yet:
de: Noch keine Freunde:
fr: Pas encore d'amis :

source: Pending Friend Requests
de: Ausstehende Freundschaftsanfragen
fr: Demandes d'amis en attente

source: (Pending)
de: (Ausstehend)
fr: (En attente)

source: Login
de: Anmelden
fr: Connexion

source: Tournaments
de: Turniere
fr: Tournois

source: Game Sessions
de: Spiel Sessions
fr: Sessions de Jeu

source: Rank List
de: Rangliste
fr: Liste des Classements

source: Change language
de: Sprache ändern
fr: Changer de langue

source: Welcome to the Pong Game!
de: Willkommen beim Pong-Spiel!
fr: Bienvenue dans le jeu Pong !

source: Use the W and S or the Arrow keys to move, for a keyboard game the other player uses O and L keys.
de: Verwenden Sie die Tasten W und S oder die Pfeiltasten, um sich zu bewegen. Für ein Tastaturspiel verwendet der andere Spieler die Tasten O und L.
fr: Utilisez les touches W et S ou les flèches pour vous déplacer, pour un jeu au clavier l'autre joueur utilise les touches O et L.

source: Start Game
de: Spiel starten
fr: Démarrer le jeu

source: Start Keyboard Game
de: Tastaturspiel starten
fr: Démarrer le jeu de clavier

source: Remove me from Waiting Queues
de: Entferne mich aus den Warteschlangen
fr: Retirez-moi des files d'attente

source: Single Game
de: Einzelspiel
fr: Jeu individuel

source: Waiting for second player. Don\'t leave this page!
de: Warten auf den zweiten Spieler. Diese Seite nicht verlassen!
fr: En attente du deuxième joueur. Ne quittez pas cette page !

source: WebSocket is open now.
de: WebSocket ist jetzt geöffnet.
fr: Le WebSocket est maintenant ouvert.

source: WebSocket message received:
de: WebSocket-Nachricht empfangen:
fr: Message WebSocket reçu :

source: Game started. Have fun!
de: Spiel gestartet. Viel Spaß!
fr: Jeu commencé. Amusez-vous bien !

source: Game ended.
de: Spiel beendet.
fr: Jeu terminé.

source: won and earned
de: hat gewonnen und verdient
fr: a gagné et a gagné

source: Game aborted!
de: Spiel abgebrochen!
fr: Jeu annulé !

source: You are already playing a game.
de: Sie spielen bereits ein Spiel.
fr: Vous jouez déjà à un jeu.

source: WebSocket is closed now.
de: WebSocket ist jetzt geschlossen.
fr: Le WebSocket est maintenant fermé.

source: WebSocket error:
de: WebSocket-Fehler:
fr: Erreur WebSocket :

source: Keyboard Game
de: Tastaturspiel starten
fr: Démarrer le jeu de clavier

source: Tournament Name
de: Turniername
fr: Nom du tournoi

source: Number of Players
de: Anzahl der Spieler
fr: Nombre de Joueurs

source: Create a new Tournament
de: Neues Turnier erstellen
fr: Créer un nouveau Tournoi

source: Tournament created:
de: Turnier erstellt:
fr: Tournoi créé :

source: Name:
fr: Nom :

source: Max amount of tournaments reached.
de: Maximale Anzahl von Turnieren erreicht.
fr: Nombre maximum de tournois atteint.

source: Tournament not found or not longer available:
de: Turnier nicht gefunden oder nicht mehr verfügbar:
fr: Tournoi non trouvé ou plus disponible :

source: Tournament is full:
de: Turnier ist voll:
fr: Le tournoi est complet :

source: You are already in this tournament:
de: Sie sind bereits in diesem Turnier:
fr: Vous êtes déjà inscrit à ce tournoi :

source: Removed from the waiting queues.
de: Aus den Warteschlangen entfernt.
fr: Retiré des files d//'attente.

source: Login to play
de: Zum Spielen einloggen
fr: Connectez-vous pour jouer

source: 2024 Pong und Pilsner. All Rights Reserved.
de: 2024 Pong und Pilsner. Alle Rechte vorbehalten.
fr: 2024 Pong und Pilsner. Tous droits réservés.

source: Profile Settings
de: Profileinstellungen
fr: Paramètres du profil

source: Display Name
de: Anzeigename
fr: Nom d'affichage

source: Current Avatar
de: Aktueller Avatar
fr: Avatar actuel

source: Enter new avatar URL
de: Neue Avatar-URL eingeben
fr: Entrez la nouvelle URL de l//'avatar

source: You can either upload a new avatar or provide a URL.
de: Sie können entweder einen neuen Avatar hochladen oder eine URL angeben.
fr: Vous pouvez soit télécharger un nouvel avatar, soit fournir une URL.

source: Save Changes
de: Änderungen speichern
fr: Enregistrer les modifications

source: This site will generate an OTP QR-Code for you to scan with your authenticator app. You can only have one code at a time, if you already have a code it will regenerate your current code for you, if you want to remove it use the remove Remove current OTP-Device link in the profile section.
de: Diese Seite generiert einen OTP-QR-Code, den Sie mit Ihrer Authentifikator-App scannen können. Sie können jeweils nur einen Code haben, wenn Sie bereits einen Code haben, wird dieser neu generiert. Wenn Sie ihn entfernen möchten, verwenden Sie den Link 'Aktuelles OTP-Gerät entfernen' im Profilbereich.
fr: Ce site générera un QR-Code OTP que vous pourrez scanner avec votre application d'authentification. Vous ne pouvez avoir qu'un seul code à la fois, si vous avez déjà un code, il régénérera votre code actuel. Si vous voulez le supprimer, utilisez le lien 'Supprimer le dispositif OTP actuel' dans la section profil.

source: After generation you have to verify the code by entering the OTP from your authenticator app. Otherwise OTP will not be activated for your account.
de: Nach der Generierung müssen Sie den Code durch Eingabe des OTP aus Ihrer Authentifikator-App verifizieren. Andernfalls wird OTP für Ihr Konto nicht aktiviert.
fr: Après la génération, vous devez vérifier le code en entrant l'OTP de votre application d'authentification. Sinon, l'OTP ne sera pas activé pour votre compte.

source: Generate OTP
de: OTP generieren
fr: Générer OTP

source: Verify OTP
de: OTP verifizieren
fr: Vérifier OTP

source: Enter OTP
de: OTP eingeben
fr: Entrer OTP

source: Show only my Game Sessions
de: Zeige nur meine Spielsitzungen
fr: Afficher uniquement mes sessions de jeu

source: Player 1
de: Spieler 1
fr: Joueur 1

source: P1 Wins
de: P1 Siege
fr: Victoires J1

source: Player 2
de: Spieler 2
fr: Joueur 2

source: P2 Wins
de: P2 Siege
fr: Victoires J2

source: Winner
de: Gewinner
fr: Vainqueur

source: you wanna login using the 42 api?
de: Möchten Sie sich über die 42 API anmelden?
fr: Vous voulez vous connecter en utilisant l'API 42 ?

source: your data is safe with us!
de: Ihre Daten sind bei uns sicher!
fr: Vos données sont en sécurité avec nous !

source: Please enter your OTP from your authenticator app:
de: Bitte geben Sie Ihr OTP aus Ihrer Authentifikator-App ein:
fr: Veuillez entrer votre OTP depuis votre application d'authentification :

source: Logout
de: Abmelden
fr: Déconnexion

source: Enable OTP with QR-Code
de: OTP mit QR-Code aktivieren
fr: Activer OTP avec QR-Code

source: Remove current OTP-Device
de: Aktuelles OTP-Gerät entfernen
fr: Supprimer le dispositif OTP actuel

source: Change Profile Info
de: Profilinformationen ändern
fr: Modifier les informations du profil

source: Player Ranking
de: Spieler-Rangliste
fr: Classement des joueurs

source: Name
fr: Nom

source: Wins
de: Siege
fr: Victoires

source: Losses
de: Niederlagen
fr: Défaites

source: Games Played
de: Gespielte Spiele
fr: Parties jouées

source: Join our exciting tournaments!
de: Nehmen Sie an unseren spannenden Turnieren teil!
fr: Rejoignez nos tournois passionnants !

source: Free slots
de: Freie Plätze
fr: Places disponibles

source: Number of players
de: Anzahl der Spieler
fr: Nombre de joueurs

source: Status
fr: Statut

source: points.
de: Punkte.

source: Date
de: Datum

source: Score
de: Punktzahl
